/* precipitation descriptor */
"blowing" = "blowing";

/* coverage amount */
"broken" = "broken";

/* precipitation type */
"drizzle" = "drizzle";

/* coverage amount */
"few" = "few";

/* obscuration type */
"fog" = "fog";

/* precipitation descriptor */
"freezing" = "freezing";

/* precipitation type */
"hail" = "hail";

/* obscuration type */
"haze" = "haze";

/* precipitation type */
"ice crystals" = "ice crystals";

/* precipitation type */
"ice pellets" = "ice pellets";

/* precipitation descriptor */
"low, drifting" = "low, drifting";

/* obscuration type */
"mist" = "mist";

/* coverage amount */
"overcast" = "overcast";

/* precipitation descriptor */
"partial" = "partial";

/* precipitation descriptor */
"patchy" = "patchy";

/* precipitation type */
"rain" = "rain";

/* obscuration type */
"sand" = "sand";

/* coverage amount */
"scattered" = "scattered";

/* precipitation descriptor */
"shallow" = "shallow";

/* precipitation descriptor */
"showering" = "showering";

/* precipitation type */
"small hail" = "small hail";

/* obscuration type */
"smoke" = "smoke";

/* precipitation type */
"snow" = "snow";

/* precipitation type */
"snow grains" = "snow grains";

/* obscuration type */
"spray" = "spray";

/* precipitation descriptor */
"thunderstorm" = "thunderstorm";

/* precipitation type */
"unknown precipitation" = "unknown precipitation";

/* obscuration type */
"volcanic ash" = "volcanic ash";

/* obscuration type */
"widespread dust" = "widespread dust";

/* remark */
"report taken due to aircraft mishap" = "report taken due to aircraft mishap";

/* list separator */
", " = ", ";

/* cloud type */
"altocumulus" = "altocumulus";

/* cloud type */
"altocumulus castellanus or altocumulus floccus" = "altocumulus castellanus or altocumulus floccus";

/* cloud type */
"altocumulus cumulogenitus" = "altocumulus cumulogenitus";

/* cloud type */
"altocumulus lenticularis" = "altocumulus lenticularis";

/* cloud type */
"altocumulus perlucidus" = "altocumulus perlucidus";

/* cloud type */
"altocumulus plus altocumulus/altostratus" = "altocumulus plus altocumulus/altostratus";

/* cloud type */
"altostratus opacus" = "altostratus opacus";

/* cloud type */
"altostratus translucidus" = "altostratus translucidus";

/* cloud type */
"chaotic" = "chaotic";

/* cloud type */
"cirrocumulus" = "cirrocumulus";

/* cloud type */
"cirrostratus increasing < 45° above horizon" = "cirrostratus increasing < 45° above horizon";

/* cloud type */
"cirrostratus increasing > 45° above horizon" = "cirrostratus increasing > 45° above horizon";

/* cloud type */
"cirrostratus with partial coverage" = "cirrostratus with partial coverage";

/* cloud type */
"cirrostratus with total coverage" = "cirrostratus with total coverage";

/* cloud type */
"cirrus fibratus" = "cirrus fibratus";

/* cloud type */
"cirrus incus" = "cirrus incus";

/* cloud type */
"cirrus spissatus" = "cirrus spissatus";

/* cloud type */
"cirrus uncinus" = "cirrus uncinus";

/* cloud type */
"cumulonimbus calvus" = "cumulonimbus calvus";

/* cloud type */
"cumulonimbus capillatus" = "cumulonimbus capillatus";

/* cloud type */
"cumulus and stratocumulus" = "cumulus and stratocumulus";

/* cloud type */
"cumulus humilis" = "cumulus humilis";

/* cloud type */
"cumulus mediocris or cumulus congestus" = "cumulus mediocris or cumulus congestus";

/* cloud type remark */
"high %@ clouds" = "high %@ clouds";

/* cloud type remark */
"high clouds obscured" = "high clouds obscured";

/* cloud type remark */
"low %@ clouds" = "low %@ clouds";

/* cloud type remark */
"middle %@ clouds" = "middle %@ clouds";

/* cloud type remark */
"middle clouds obscured" = "middle clouds obscured";

/* cloud type remark */
"no high clouds observed" = "no high clouds observed";

/* cloud type remark */
"no low clouds observed" = "no low clouds observed";

/* cloud type remark */
"no middle clouds observed" = "no middle clouds observed";

/* cloud type */
"obscured" = "obscured";

/* cloud type */
"stratocumulus" = "stratocumulus";

/* cloud type */
"stratocumulus cumulogenitus" = "stratocumulus cumulogenitus";

/* cloud type */
"stratus fractus" = "stratus fractus";

/* cloud type */
"stratus nebulosus" = "stratus nebulosus";

/* precipitation amount */
"%0.2f inches of precipitation in the last 24 hours" = "%0.2f inches of precipitation in the last 24 hours";

/* remark */
"indeterminate precipitation in the last 24 hours" = "indeterminate precipitation in the last 24 hours";

/* remark */
"trace precipitation in the last 24 hours" = "trace precipitation in the last 24 hours";

/* remark */
"24-hour temperature low %0.1f °C, high %0.1f °C" = "24-hour temperature low %1$.1f °C, high %2$.1f °C";

/* remark */
"hail %@ inches in diameter" = "hail %@ inches in diameter";

/* precipitation amount */
"%0.2f inches of precipitation in the last hour" = "%0.2f inches of precipitation in the last hour";

/* remark */
"trace precipitation in the last hour" = "trace precipitation in the last hour";

/* remark: lightning frequency, direction
   remark: lightning frequency, proximity */
"%@ %@" = "%1$@ %2$@";

/* remark: lightning frequency, proximity, direction */
"%@ %@ %@" = "%1$@ %2$@ %3$@";

/* remark: lightning frequency, type */
"%@ (%@)" = "%1$@ (%2$@)";

/* remark: lightning frequency, type, direction
   remark: lightning frequency, type, proximity */
"%@ (%@) %@" = "%1$@ (%2$@) %3$@";

/* remark: lightning frequency, type, proximity, direction */
"%@ (%@) %@ %@" = "%1$@ (%2$@) %3$@ %4$@";

/* lightning remark: frequency known */
"%@ lightning" = "%@ lightning";

/* list separator */
", " = ", ";

/* lightning type */
"cloud-to-air" = "cloud-to-air";

/* lightning type */
"cloud-to-cloud" = "cloud-to-cloud";

/* lightning type */
"cloud-to-ground" = "cloud-to-ground";

/* lightning type */
"in-cloud" = "in-cloud";

/* lightning remark: frequency unknown */
"lightning" = "lightning";

/* remark */
"station requires maintenance" = "station requires maintenance";

/* remark */
"no SPECI reports will be made until the next scheduled METAR" = "no SPECI reports will be made until the next scheduled METAR";

/* coverage amount, obscuration, height */
"%@ %@ at %@" = "%1$@ %2$@ at %3$@";

/* obscuration, height */
"%@ at %@" = "%1$@ at %2$@";

/* height */
"%lu feet" = "%lu feet";

/* obscurations with height = 0 */
"surface" = "surface";

/* remark */
"automated weather observing" = "automated weather observing";

/* remark */
"automated weather observing (plus precipiation sensor)" = "automated weather observing (plus precipiation sensor)";

/* remark */
"unknown weather observing" = "unknown weather observing";

/* remark */
"surface visibility %@ SM" = "surface visibility %@ SM";

/* remark */
"tower visibility %@ SM" = "tower visibility %@ SM";

/* remark */
"peak winds %ld° at %ld knots (%@)" = "peak winds %1$ld° at %2$ld knots (%3$@)";

/* precipitation amount, period length in hours */
"%0.2f inches of precipitation in the last %@ hours" = "%1$.2f inches of precipitation in the last %2$@ hours";

/* unknown period length for 3-/6-hour precip totals remark */
"3 or 6" = "3 or 6";

/* period length in hours */
"indeterminate precipitation in the last %@ hours" = "indeterminate precipitation in the last %@ hours";

/* period length in hours */
"trace precipitation in the last %@ hours" = "trace precipitation in the last %@ hours";

/* precipitation descriptor + type */
"%@ %@" = "%1$@ %2$@";

/* precipitation event: type, time */
"%@ began at %@" = "%1$@ began at %2$@";

/* precipitation event: type, time */
"%@ ended at %@" = "%1$@ ended at %2$@";

/* list separator */
", " = ", ";

/* pressure tendency remark */
"barometric pressure %0.1f hPa higher than three hours ago and increasing" = "barometric pressure %0.1f hPa higher than three hours ago and increasing";

/* pressure tendency remark */
"barometric pressure %0.1f hPa higher than three hours ago and increasing more rapidly" = "barometric pressure %0.1f hPa higher than three hours ago and increasing more rapidly";

/* pressure tendency remark */
"barometric pressure %0.1f hPa higher than three hours ago and increasing more slowly" = "barometric pressure %0.1f hPa higher than three hours ago and increasing more slowly";

/* pressure tendency remark */
"barometric pressure %0.1f hPa lower than three hours ago and decreasing" = "barometric pressure %0.1f hPa lower than three hours ago and decreasing";

/* pressure tendency remark */
"barometric pressure %0.1f hPa lower than three hours ago and decreasing more rapidly" = "barometric pressure %0.1f hPa lower than three hours ago and decreasing more rapidly";

/* pressure tendency remark */
"barometric pressure %0.1f hPa lower than three hours ago and decreasing more slowly" = "barometric pressure %0.1f hPa lower than three hours ago and decreasing more slowly";

/* pressure tendency remark */
"barometric pressure same as three hours ago after decreasing then increasing" = "barometric pressure same as three hours ago after decreasing then increasing";

/* pressure tendency remark */
"barometric pressure same as three hours ago after increasing then decreasing" = "barometric pressure same as three hours ago after increasing then decreasing";

/* pressure tendency remark */
"barometric pressure stable" = "barometric pressure stable";

/* pressure tendency remark */
"barometric pressure still %0.1f hPa higher than three hours ago despite decreasing" = "barometric pressure still %0.1f hPa higher than three hours ago despite decreasing";

/* pressure tendency remark */
"barometric pressure still %0.1f hPa lower than three hours ago despite increasing" = "barometric pressure still %0.1f hPa lower than three hours ago despite increasing";

/* remark */
"pressure falling rapidly" = "pressure falling rapidly";

/* remark */
"pressure rising rapidly" = "pressure rising rapidly";

/* snow depths */
"rapid snow increase: %lu inches in the past hour (%lu inches total)" = "rapid snow increase: %1$lu inches in the past hour (%2$lu inches total)";

/* runway, ceiling */
"ceiling at runway %@ is %lu feet" = "ceiling at runway %1$@ is %2$lu feet";

/* remark */
"runway %@ visibility %@ SM" = "runway %1$@ visibility %2$@ SM";

/* pressure in hPa */
"sea-level pressure %0.1f hPa" = "sea-level pressure %0.1f hPa";

/* remark */
"sea-level pressure not available" = "sea-level pressure not available";

/* remark */
"%@ sector visibility %@ SM" = "%1$@ sector visibility %2$@ SM";

/* remark (location) */
"ceiling sensor for %@ not operating" = "ceiling sensor for %@ not operating";

/* remark */
"freezing rain sensor not operating" = "freezing rain sensor not operating";

/* remark */
"lightning sensor not operating" = "lightning sensor not operating";

/* remark */
"present weather identifier not operating" = "present weather identifier not operating";

/* remark */
"runway visual range missing" = "runway visual range missing";

/* remark */
"tipping bucket rain gauge not operating" = "tipping bucket rain gauge not operating";

/* remark (location) */
"visibility sensor for %@ not operating" = "visibility sensor for %@ not operating";

/* appended to significant clouds remark */
" (distant)" = " (distant)";

/* cloud type, direction */
"%@ %@" = "%1$@ %2$@";

/* cloud type, direction, moving direction */
"%@ %@ moving %@" = "%1$@ %2$@ moving %3$@";

/* cloud type, direction to direction */
"%@ %@ to %@" = "%1$@ %2$@ to %3$@";

/* cloud type, direction to direction, moving direction */
"%@ %@ to %@ moving %@" = "%1$@ %2$@ to %3$@ moving %4$@";

/* significant cloud type */
"altocumulus castellanus" = "altocumulus castellanus";

/* cloud type, direction */
"apparent %@ %@" = "apparent %1$@ %2$@";

/* cloud type, direction, moving direction */
"apparent %@ %@ moving %@" = "apparent %1$@ %2$@ moving %3$@";

/* cloud type, direction to direction */
"apparent %@ %@ to %@" = "apparent %1$@ %2$@ to %3$@";

/* cloud type, direction to direction, moving direction */
"apparent %@ %@ to %@ moving %@" = "apparent %1$@ %2$@ to %3$@ moving %4$@";

/* significant cloud type */
"cumulonimbus" = "cumulonimbus";

/* significant cloud type */
"cumulonimbus mammatus" = "cumulonimbus mammatus";

/* significant cloud type */
"rotor cloud" = "rotor cloud";

/* significant cloud type */
"standing lenticular altocumulus" = "standing lenticular altocumulus";

/* significant cloud type */
"standing lenticular cirrocumulus" = "standing lenticular cirrocumulus";

/* significant cloud type */
"standing lenticular stratocumulus" = "standing lenticular stratocumulus";

/* significant cloud type */
"towering cumulus" = "towering cumulus";

/* remark */
"six-hour temperature maximum is %0.1f °C" = "six-hour temperature maximum is %0.1f °C";

/* remark */
"six-hour temperature minimum is %0.1f °C" = "six-hour temperature minimum is %0.1f °C";

/* depth in inches */
"snow depth %lu inches" = "snow depth %lu inches";

/* remark */
"%lu minutes of sunshine during the previous calendar day" = "%lu minutes of sunshine during the previous calendar day";

/* remark */
"temperature %0.1f °C" = "temperature %0.1f °C";

/* remark */
"temperature %0.1f °C, dewpoint %0.1f °C" = "temperature %1$.1f °C, dewpoint %2$.1f °C";

/* remark */
"thunderstorm began at %@ and ended at %@" = "thunderstorm began at %1$@ and ended at %2$@";

/* direction */
"thunderstorms %@" = "thunderstorms %@";

/* direction, movement direction */
"thunderstorms %@ moving %@" = "thunderstorms %1$@ moving %2$@";

/* tornadic remark: type, time, distance, direction */
"%@ began at %@, %ld SM %@" = "%1$@ began at %2$@, %3$ld SM %4$@";

/* tornadic remark: type, time, distance, direction, moving direction */
"%@ began at %@, %ld SM %@ moving %@" = "%1$@ began at %2$@, %3$ld SM %4$@ moving %5$@";

/* tornadic remark: type, time, distance, direction */
"%@ ended at %@, %ld SM %@" = "%1$@ ended at %2$@, %3$ld SM %4$@";

/* tornadic remark: type, time, distance, direction, moving direction */
"%@ ended at %@, %ld SM %@ moving %@" = "%1$@ ended at %2$@, %3$ld SM %4$@ moving %5$@";

/* tornadic type */
"funnel cloud" = "funnel cloud";

/* tornadic type */
"tornado" = "tornado";

/* tornadic type */
"waterspout" = "waterspout";

/* low and high ceilings */
"ceiling variable between %lu and %lu feet" = "ceiling variable between %1$lu and %2$lu feet";

/* remark */
"prevailing visibility varying from %@ to %@ SM" = "prevailing visibility varying from %1$@ to %2$@ SM";

/* coverages */
"sky coverage varies between %@ and %@" = "sky coverage varies between %1$@ and %2$@";

/* coverages and height */
"sky coverage varies between %@ and %@ at %ld feet" = "sky coverage varies between %1$@ and %2$@ at %3$ld feet";

/* remark */
"virga observed" = "virga observed";

/* remark: direction */
"virga observed %@" = "virga observed %@";

/* depth in inches */
"%0.1f inches water equivalent snow depth" = "%0.1f inches water equivalent snow depth";

/* remark: time */
"wind shift at %@" = "wind shift at %@";

/* remark: time */
"wind shift at %@ due to frontal passage" = "wind shift at %@ due to frontal passage";

/* direction list (e.g. north and west) */
" and " = " and ";

/* direction range (e.g. north through west) */
"%@ through %@" = "%1$@ through %2$@";

/* range of directions */
"all directions" = "all directions";

/* direction */
"all quadrants" = "all quadrants";

/* frequency */
"constant" = "constant";

/* proximity */
"distant" = "distant";

/* direction */
"east" = "east";

/* frequency */
"frequent" = "frequent";

/* proximity */
"in the vicinity" = "in the vicinity";

/* direction */
"north" = "north";

/* direction */
"northeast" = "northeast";

/* direction */
"northwest" = "northwest";

/* frequency */
"occasional" = "occasional";

/* proximity */
"overhead" = "overhead";

/* direction */
"south" = "south";

/* direction */
"southeast" = "southeast";

/* direction */
"southwest" = "southwest";

/* direction */
"west" = "west";

/* No comment provided by engineer. */
"Unknown METAR remark" = "Unknown METAR remark";

/* improper fraction */
"%ld%@" = "%1$ld%2$@";

